const questions = [
    {
      id: 1,
      question:
      "ما هي التقنية التي تجذب انتباهك في صناعة الألعاب؟",
      answers: [
        {
            text: "أجد التطورات في تقنية الذكاء الاصطناعي المستخدمة في الألعاب مثيرة للاهتمام.",
            cat: "PROGRAMMER or DESIGNER ",
        },
        {
            text: "أعتقد أن تقنيات الرسوميات المتقدمة وتقنيات الإضاءة تلعب دورًا حاسمًا في جودة الألعاب.",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: "أحب تطوير ألعاب الويب واستخدام تقنيات الويب المتقدمة لتحقيق تجربة مستخدم سلسة.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "أعجب بتقنيات الواقع الافتراضي والواقع المعزز وكيف يتم دمجها في تجربة اللعبة.",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
    {
      id: 2,
      question:
      "ما هي الأدوات والبرامج التي استخدمتها في تطوير الألعاب؟",
      answers: [
        {
            text: "لقد استخدمت محركات ألعاب مثل Unity أو Unreal Engine ولدي خبرة في برمجة الأكواد باستخدام C# أو C++.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text:"اعتمدت على أدوات تصميم العوالم والمستويات مثل Tiled أو World Machine لإنشاء بيئات اللعبة.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text:" استخدمت برامج تصوير الصوت وتسجيل الأصوات مثل Audacity أو Adobe Audition لإضافة تأثيرات صوتية إلى الألعاب.",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: "استخدمت برامج التصميم والرسم مثل Adobe Photoshop أو Illustrator لإنشاء الرسومات والشخصيات.",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
    {
      id: 3,
      question:
      "هل لديك خبرة في تصميم وتحريك الشخصيات ثلاثية الأبعاد؟",
      answers: [
        {
            text: "لا، ليس لدي خبرة في تصميم وتحريك الشخصيات ثلاثية الأبعاد، ولكن لدي اهتمام في العمل مع فريق لديهم مهارات في هذا المجال.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text:" نعم، لدي خبرة في تصميم وتحريك الشخصيات ثلاثية الأبعاد .",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: "أجد تصميم الشخصيات ثلاثية الأبعاد مثيرًا ولكن أفضل التركيز على تصميم العوالم والمستويات في الألعاب.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "أفضل العمل في تصميم الشخصيات ثنائية الأبعاد باستخدام برامج الرسم الرقمي",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
    {
      id: 4,
      question: "هل لديك خبرة في تصميم المستويات والعوالم في الألعاب؟",
      answers: [
        {
            text: "نعم، لدي خبرة في تصميم المستويات والعوالم وأستخدم أدوات تصميم العوالم مثل Unity أو Unreal Engine.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "لا، ليس لدي خبرة في تصميم المستويات والعوالم، ولكن لدي اهتمام بتعلمها واكتساب مهارات التصميم لإنشاء تجارب لعب ممتعة.",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: "أجد التفاعل مع اللاعبين وتصميم تحديات مثيرة في المستويات أمرًا دارج داخل اهتمامي ولا أفضل التركيز على تصميم العوالم والمستويات.",
            cat: "PROGRAMMER or DESIGNER",  
        },
        {
            text: "أفضل العمل مع فريق التطوير في تصميم العوالم واستخدام رؤيتي الفنية في تحقيق الأجواء المناسبة للعبة.",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
    {
      id: 5,
      question:
      "هل لديك خبرة في تطوير القصص والسيناريو في الألعاب لضمان تفاعل اللاعبين مع الأحداث ؟",
      answers: [
        {
            text: "نعم، لدي القدرة على تطوير القصص والسيناريو في الألعاب وأستمتع بإنشاء عوالم و تصميم المراحل الغنية بالقصص .",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "ليس لدي اهتمام ,و لكن أحب تصميم الشخصيات ورسمها بناء على السيناريو ونوع اللعبه المتفق عليه من قبل فريقي",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: "أفضل العمل مع فريق متكامل لتطوير قصة اللعبة وتحويلها إلى واقع، ومواجهة التحديات في صناعة اللعبة.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "لدي القدرة على رسم ثيم اللعبه وشخصيات من اجل مصمم المراحل ومحرك الشخصيات ",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
    {
      id: 6,
      question: "هل لديك تجربة في تطوير الألعاب المتنقلة؟",
      answers: [
        {
            text: "نعم، لدي تجربة في تطوير الألعاب المتنقلة على منصات مثل iOS و Android.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "لا، ليس لدي تجربة في تطوير الألعاب المتنقلة، ولكن لدي فهم عام لمتطلبات تلك المنصات.",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: "لقد قمت بتطوير بعض الألعاب المتنقلة البسيطة باستخدام أدوات مثل Unity ولدي فهم أساسي لعملية التطوير على تلك المنصات.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "لا، أعمل في مجال آخر من تطوير الألعاب ولم أتعامل مع الألعاب المتنقلة بشكل خاص.",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
    {
      id: 7,
      question: "ما هي ألعاب الفيديو المفضلة لديك؟",
      answers: [
        {
            text: "أفضل الألعاب التكتيكية وألعاب الأدوار القائمة على القصة مثل سلسلة Final Fantasy وسلسلة Fire Emblem.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "أحب ألعاب العالم المفتوح والمغامرات الملحمية مثل سلسلة The Legend of Zelda وسلسلة Assassin's Creed.",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: " أنا مهووس بألعاب الرعب والبقاء على قيد الحياة مثل سلسلة Resident Evil وسلسلة Silent Hill.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "أعشق الألعاب المنصات الكلاسيكية مثل سوبر ماريو وسونيك، وأيضًا ألعاب الألغاز الذكية مثل Portal وThe Witness.",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
    { 
      id: 8,
      question:
      "ما هو الجانب الذي تشعر بأنه يناسب قدراتك واهتماماتك أكثر؟",
      answers: [
        {
            text: "تصميم واجهة المستخدم وتجربة المستخدم",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "تصميم الشخصيات والرسومات",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: "تصميم المستويات والألعاب",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: " تصميم الأصوات والمؤثرات الصوتية",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
    {
      id: 9,
      question:
      "ما هو المجال الذي تشعر بأنك تتمتع بمهاراته وقدراته في صناعة الألعاب؟",
      answers: [
        {
            text: "أنا ملم ببرمجة الألعاب وتطوير النظم والتفاعلات، وأستمتع بتحقيق الأفكار والتحديات الفنية.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "أنا أجيد التصميم الفني والرسومات، وأستمتع بإنشاء شخصيات وعوالم مبتكرة.",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: "أنا متمكن في تصميم تجربة الألعاب وإيجاد التحديات المناسبة، وأستمتع بتوفير تجربة لعب ممتعة ومسلية للاعبين.",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "أنا متمكن في تقنيات الحركة والتحريك، وأستمتع بإعطاء الحياة للشخصيات وتحقيق الحركات الواقعية.",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
    {
      id: 10,
      question:
      "ماذا تفضل أن تكون ؟",
      answers: [
        {
            text: "THE DESIGNER",
            cat: "PROGRAMMER or DESIGNER",
        },
        {
            text: "THE ARTIST ",
            cat: "ARTIST or ANIMATOR",
        },
        {
            text: " THE PROGRAMMER",
            cat: "PROGRAMMER or DESIGNER",
            
        },
        {
            text: "THE ANIMATOR",
            cat: "ARTIST or ANIMATOR",
        },
      ],
    },
  ];
  
  module.exports = questions;
  
  
  
  
  
  
  
  
  
  
  
  
  
  